from main import check_and_correct_text

def test_correct_words():
    assert check_and_correct_text("відеорепортаж") == "відеорепортаж (правильно: з першою частиною авіа-, аудіо-, агро-, відео-, екстра-, кіно-, мокро-, мікро-, моно-, радіо-, супер-, стерео-)"
    assert check_and_correct_text("прем’єр-міністр") == "прем’єр-міністр (правильно: назви посад, професій, спеціальностей)"

def test_incorrect_words():
    assert check_and_correct_text("відеорепорт") == "відеорепорт -> відеорепортаж (виправлено: з першою частиною авіа-, аудіо-, агро-, відео-, екстра-, кіно-, мокро-, мікро-, моно-, радіо-, супер-, стерео-)"
    assert check_and_correct_text("неіснуюче") == "неіснуюче (не знайдено в базі даних)"

def test_empty_text():
    assert check_and_correct_text("") == "Помилка: Введений текст порожній. Будь ласка, введіть текст для перевірки."
